RedditOnRails/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zGJNPZf9EHyHOErN8S2tAQ"], ["updated_at", "2018-09-18 18:36:09.287376"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!