RedditOnRails/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "axRn-pHyYn3STIGeh_KP8g"], ["updated_at", "2018-09-18 21:02:11.665873"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "asdfas"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, pw)
    user = User.find_by(username: username)