RedditOnRails/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 4], ["sub_id", 1], ["created_at", "2018-09-19 00:01:18.068896"], ["updated_at", "2018-09-19 00:01:18.068896"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test1"], ["url", "test1"], ["content", "test1"], ["sub_id", 1], ["user_id", 1], ["created_at", "2018-09-18 22:28:41.725758"], ["updated_at", "2018-09-18 22:28:41.725758"]]
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" WHERE "subs"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
DELETE FROM "post_subs" WHERE "post_subs"."post_id" = $1 AND "post_subs"."sub_id" IN ($2, $3) AND "post_subs"."post_id" = $4  [["post_id", 1], ["sub_id", 1], ["sub_id", 2], ["post_id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    sub_id = @post.sub_id
    @sub = Sub.find(sub_id)
    @post.destroy