RedditOnRails/app/controllers/posts_controller.rb

  def new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def edit
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def update
    @post = Post.find(params[:id])

    unless @post.author == current_user
      flash[:errors] = ['You are not the author of this post']
      redirect_to post_url(@post)
    end

    if @post.update(post_params)
      redirect_to post_url(@post)
    else
      @subs = Sub.all
---
SELECT "subs".* FROM "subs" WHERE 1=0