RedditOnRails/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Weird Bugs"], ["description", "Weird bugs."], ["user_id", 1], ["created_at", "2018-09-18 22:06:51.849512"], ["updated_at", "2018-09-18 22:06:51.849512"]]